src/devel_workbook.org
#+PROPERTY: noweb yes
#+PROPERTY: padline no

# Muista tehdä linkki TMaVT osoittamaan oikeaan paikkaan, joka on kirjasto,
# josta löytyy model_io.py. Tarvitaan, kun LSTS käännetään lisp-rakenteeksi.
# Tällä hetkellä lisätyökaluja ei välttämättä tarvita autogit.el tiedoston
# kasaamiseen (tangling)

#+begin_src emacs-lisp :exports none :results value silent
  (progn
    (require 'ob-python)
    (setq org-confirm-babel-evaluate (lambda (lang body)
                                         (not (or (string= lang "python")
                                                  (string= lang "emacs-lisp")))))
    )
#+end_src

* Licence and user documentation

#+name: product_title
#+begin_src text
autogit-mode for GNU Emacs
#+end_src

#+name: header_license_text
#+begin_src text
Version: alpha - 0.1 (not a true mode yet)
Copyright: Heikki Virtanen (2013)
License: GPL
Homepage: https://github.com/hessuvi/autogit-mode

Purpose: Keep working repository (and opened files) in sync with its
         upstream automatically.

Architecture:
  - Global mode. All open buffers visiting file in git repository are
    tracked by autogit. (Note: Autogit works in local mode, if current
    branch have no upstream set.)

  - Each repository is tracked separately.

Setting up:
  + Ones:
    - git config --global merge.conflictstyle diff3
    - git config --global push.default upstream

  + For each repository and branch, which are intended to be synced
    automatically:
    - git branch --set-upstream ...

Usage:
  - emacs --load <path to autogit.el>
  - autogit works seamlessly in background and no explicit actions are
    needed.

Hints:
  - Be careful with sensitive data! Setup your .gitignore in advance,
    if you do not have any other choice than keeping sensitive data
    within the repository.
  - If git merge --squash is used for integration, new session branch have
    to be created and have to be based on the tip of the integration branch.
  - Magit (http://magit.github.io/magit/) is still useful. This is not
    replacement of any Emacs' VC package.
  - GPG agent can be used as ssh-agent replacement. Advance is that
    private keys are decrypted only when needed.
#+end_src
#+begin_src emacs-lisp :tangle ../autogit.el
;; <<product_title>>
;;
;; <<header_license_text>>
;;

#+end_src

#+begin_src text :tangle ../readme.txt
,* <<product_title>>

<<header_license_text>>

,* Why

Collaboration is one of the key elements of productivity and pleasure.
Unfortunately, web based solutions have many nasty problems. Those lack
decent editing capabilities for text and source code, there is no support
for working off-line, data is stored in dedicated server which is maintained
solely by service provider and it is not possible to set up or buy
independent server sided services, a few to mention.

Git and Emacs with Magit is a handy tool combination and functionally it is
sufficient working environment. However, user experience is still somewhat
clumsy, since staging, committing, pulling, and pushing have to be done
manually over and over again. And it is easy to forget to commit and push
the last modifications of the day. Automation can help on these problems,
so, why not to use it?

,* How

Formal methods are seen as a waterfall century dinosaurs and anything but
agile. But have anybody tried to use them in order to make programming more
straightforward and gain development speed? This is small experiment for
that.

There have been following development steps:
1. Identified operating scenarios was combined into a single, transition
   based behavioural model.
2. The model was minimised and validated and verified using Tampere
   Verification Tool and visual verification
   (https://github.com/hessuvi/TampereVerificationTool).
3. The behavioural model, aka state machine, was translated algorithmically
   to Emacs-lisp data structure, which is core of the system. Also, the
   functionality for wandering in the state machine was implemented.
4. The system was first tested with stub functions for the actions.
5. And finally, the actions was implemented and the system was tested in
   real-world conditions.

Unfortunately, all tools used in the development process are not publicly
available yet. One purpose of this project was to test this new development
method and tools supporting it and some new requirements was found. The
auxiliary tools will be released when these new features are decently
implemented.
#+end_src

* Käyttöön ja käyttöönottoon liittyviä seikkoja

** Mahdollisia riskitekijöitä

  - Johonkin tiedostoon kirjoitettu sensitiivinen data lähtee turhan
    liukkaasti maailmalle, jos ei ole laittanut .gitignore tiedostoa ennalta
    kuntoon.
  - Suorituskyvystä voi joissain tapauksissa tulla ongelma. Jos jostain
    syystä git pull ja push kestää, niin järjestelmästä tulee lähes
    käyttökelvoton, koska niitä tehdään paljon ja muuten nopeiden
    operaatioiden yhteydessä.

** Emacs

  - Ei vaadita mitään erityisiä toimia. Ladataan autogit.el ja se aktivoi
    read, after-save ja kill-buffer hookit tuottamaan autogit sydeemin
    tuntemia herätteitä.

  - Tiedostojen tuhoaminen ei päivity gitille automaattisesti, vaikka sen
    tekisi dired ympäristön kautta. Siksi kaveriksi suositellaan Emacsin
    magit pakettia, jonka avulla voi seurata gitin toimintaa ja tarvittaessa
    antaa lisäkomentoja.


** git

Käyttäjän pitäisi osata
- Määritellä repon asetukset niin, että git pull ja git push toimivat
  järkevästi ilman parametrejä. (autogit toimii pelkästään paikallisesti jos
  parametrittomat versiot palauttavat virheen.

(TODO: ikuisen silmukan esto  git push komennon epäonnistuessa toistuvasti)

- Olla käsitys, mitä konfliktin korjaaminen käytännössä tarkoittaa.

- Tarvittavia protokollia (esim. ssh ja https) varten sellaiset säädöt,
  ettei salakalaa kysytä interaktiivisesti päätteeltä. Graafisessa
  ympäristössä popup OK. (Itse tykkään gpg-agenttista ssh-agent ohjelman
  korvaajana.)


* Visioituja käyttöskenaarioita

** Tärkeä kirjoitus tai ohjelmointityö

   ... jonka varmuuskopion haluaa aina olevan ajan tasalla toisella koneella.

** Ohjelmointi/kirjoittaminen kaverien kanssa.

   Työpöydällä on auki myös skype tai irc, jonka kautta voi keskustella.


** Sosiaalisen median alusta

   - Jossain on ajossa gitolite ja sen huomassa repo keskusteluryhmää
     varten.
   - Emacsin org-mode asetetaan käyttämään joitain paikallisen repon
     tiedostoja kalenteritiedostoina, joista kerätään tiedot agenda näkymään.
   - Jokaisen päivityksen otsikon yhteyteen kirjoitetaan nimimerkki tagiksi
     ja otsikon alle päivämäärä ja kellonaika. Näin mielenkiintoiset jutut
     voi poimia suoraan agenda näkymästä.


* Toteutustekniikka ja arkkitehtuuri


* Development notes

** DONE Toteutusvälineet: SM-lang kieleen monta tapahtuman lopputilaa

Seuraavassa on käytetty uutta funktiokutsun kaltaista syntaksia, jossa
sanoman paluuarvo määrää lopputilan. Tilakonekielen kääntäjään pitää vielä
ohjelmoida vastaava rakenne. Toteutusarvaus on, että ensin funktiokutsua
vastaava tilasiirtymä ja sen lopputilasta indeksiin perustuvat sisäiset
siirtymät määriteltyihin lopputiloihin.

Seuraavia tiedostoja tarvitsee muuttaa.
file:~/Tutkimus/Tools/TVT-AddOns/sm_lang_comp.py
file:~/Tutkimus/Tools/TVT-AddOns/TMaVT/tok_sm_lang.py

** TODO Muistiinpanoja mietinnässä olevista asioista [5/8]

Seuraavassa vielä hieman löydettyjä puutteita ja toteutuksessa huomioon
otettavia asioita:
  - [X] add voit myös epäonnistua (tiedostoa ei voi lisätä repoon)

  - [X] commit epäonnistuu myös siksi, että ei ole mitään commitoitavaa.
    Tällöinkin pitäisi kai tehdä syncci. Jos commit epäonnistuu muusta
    syystä, seuraava pull epäonnistuu myös. Merge conflictin jälkeen tulee
    aina jotain kommitoitavaa, joten silloin lienee turvallista käyttää
    commitin paluuarvoa haarautumiseen (TESTATTAVA!!!).

  - [X] Tiloissa unstable_state ja repair odotellaan, että käyttäjä tekee
    jonkin mainituista asioista. Käyttäjä voi tehdä toki muutakin, mutta
    siitä järjestelmä ei välitä.

  - [X] Myös järjestelmän omat tekemiset aiheuttavat järjestelmän
    tunnistamia herätteitä. Tästä syystä herätteiden vastakutsujen pitää
    tunnistaa aluksi tarkistaa, ollaanko suorittamassa järjestelmän koodia
    vai ei.

  - [X] Paikallinen repository voi olla muuttunut editointi-istuntojen
    välillä, tai jopa istunnon aikana. Toisaalta pull epäonnistuu, jos on
    paikallisia muutoksia tallentamatta versionhallintaan. Eli no problemo.

  - [ ] On vähän ikävää, ettei autogit moodin aktivoituessa käydä avoinna
    olevia puskureita lävitse ja lisätä niitä vastaaviin repoihin. Tulee
    toimeen ilmankin, mutta hommaan jää vähän yllätyksiä.

    Toteutuksena tämä kai menisi niin, että
    1. Jokaiselle avoinna olevalle bufferille
       1. Jos bufferilla on tiedosto, valitaan bufferi aktiiviseksi.
       2. Pyydetään bufferia vastaava repo ja aktivoidaan se.
       3. Ajetaan autogit-append bufferille.

    Itse asiassa tämä olisi erittäin tärkeä ominaisuus. Ilman tätä jää
    vaaraksi, että sellainen tiedosto, jota on muutettu mutta ei
    tallennettu, muuttuu taustalla levyllä, jolloin käyttäjä on pienoisissa
    vaikeuksissa.

  - [ ] Vastaavasti autogit-modea deaktivoitaessa pitäisi kaikki autogitin
    työbufferit poistaa. Eli jälleen tarvitaan yksi lista, johon ne on kerätty.

  - [ ] Rakentaa autogit oikeaksi gloaaliksi modeksi, jonka saa autogit-mode
    funktiota ajamalla päälle ja pois.

* Implementation

