autogit.el
;; autogit-mode for GNU Emacs
;;
;; Version: alpha - 0.1 (not a true mode yet)
;; Copyright: Heikki Virtanen (2013)
;; License: GPL
;; Homepage: https://github.com/hessuvi/autogit-mode
;; 
;; Purpose: Keep working repository (and opened files) in sync with its
;;          upstream automatically.
;; 
;; Architecture:
;;   - Global mode. All open buffers visiting file in git repository are
;;     tracked by autogit. (Note: Autogit works in local mode, if current
;;     branch have no upstream set.)
;; 
;;   - Each repository is tracked separately.
;; 
;; Setting up:
;;   + Ones:
;;     - git config --global merge.conflictstyle diff3
;;     - git config --global push.default upstream
;; 
;;   + For each repository and branch, which are intended to be synced
;;     automatically:
;;     - git branch --set-upstream ...
;; 
;; Usage:
;;   - emacs --load <path to autogit.el>
;;   - autogit works seamlessly in background and no explicit actions are
;;     needed.
;; 
;; Hints:
;;   - Be careful with sensitive data! Setup your .gitignore in advance,
;;     if you do not have any other choice than keeping sensitive data
;;     within the repository.
;;   - If git merge --squash is used for integration, new session branch have
;;     to be created and have to be based on the tip of the integration branch.
;;   - Magit (http://magit.github.io/magit/) is still useful. This is not
;;     replacement of any Emacs' VC package.
;;   - GPG agent can be used as ssh-agent replacement. Advance is that
;;     private keys are decrypted only when needed.
;;
