src/devel_workbook.org
** Behavioural model for repository object

[2013-09-30 ma] Tässä vielä kerran uusiksi tehty repositoryn toimintaa
vastaava tilakone. Nyt tekemisen mallina oli iteratiivinen prosessi.
Kuvataan lineaarisia sekvenssejä ja haarautumisen paikoissa laitetaan muihin
vaihtoehtoihin lukkiuma merkiksi. Näistä keskeneräisiksi jääneistä kohdista
jatkettiin myöhemmin. Myöskään tilakoneen yksinkertaisuuteen tai
ylläpidettävyyteen ei kiinnitetty erityistä huomiota. Korvaukseksi tein
python scriptin, joka muuntaa kutistetun tilakoneen sellaiseen muotoon, että
siinä voi samoilla elispillä.

#+begin_src fundamental :tangle uusi_versio.sml
REPO -> i_wait
 * i_wait : "open" -> s1
   	    "kill" -> i_wait
            "revert" -> i_wait
	    "save" -> i_save
 * s1 : "autogit-append" -> s2_
 * s2_ : "autogit-unsaved-changes" -> ( n_wait n3 )
 * s2 : "autogit-do-pull" -> ( s3 i_repair )
 * s3 : "autogit-do-push" -> ( s4 s2 )
 * s4 : "autogit-revert-all" -> n_wait
 * i_save : "autogit-append" -> s6
 * s6 : "autogit-do-add" -> ( nC nC )
 * s7 : "autogit-do-commit" -> ( s8 s8 )
 * s8 : "autogit-do-pull" -> ( s9 i_repair )
 * s9 : "autogit-do-push" -> ( sA s8 )
 * sA : "autogit-revert-all" -> n_wait
 * n_wait : "open"   -> n1
            "save"   -> nA
   	    "kill"   -> m0
	    "revert" -> nC

 * n1 : "autogit-append" -> n2
 * n2 : "autogit-unsaved-changes" -> ( n_wait n3 )
 * n3 : "autogit-do-pull" -> ( n4 i_repair )
 * n4 : "autogit-do-push" -> ( s4 n3 )
 * nA : "autogit-append" -> nB
 * nB : "autogit-do-add" -> ( nC nC )
 * nC : "autogit-unsaved-changes" -> ( n_wait nD )
 * nD : "autogit-do-commit" -> ( n3 n3 )

 * m0 : "autogit-remove" -> nC

 * i_repair : "autogit-revert-all" -> r_wait
 * r_wait : "open"   -> r1
	    "save"   -> rA
	    "kill"   -> rX
	    "revert" -> rC

 * r1 : "autogit-append" -> r_wait
 * rA : "autogit-append" -> rB
 * rB : "autogit-do-add" -> ( rC rC )
 * rC : "autogit-unsaved-changes" -> (r_wait rD)
 * rD : "autogit-do-commit" -> ( n3 r_wait )
 * rX : "autogit-remove" -> rC
#+end_src

[2013-10-01 ti] Yllä olevaa lienee mahdollista optimoida tuottamaan
pienempi ajettava LSTS. Koska repon alkutilassa voi tulla vain heräte
open tai save, niin on aivan sama, minne revert ja kill
ohjataan. Sopivilla valinnoilla lopputuloksessa tilat i_wait ja n_wait
saattaisivat yhdistyä. Teorian tasolla tämän mahdollisuuden voi
testata, kytkemällä eri vaihtoehtojen rinnalle tilakoneen
#+begin_src fundamental :tangle repo_usage.sml
REPO_USE -> s0
 * s0 : "open" -> s1
        "save" -> s1
 * s1 : "open" -> s1
	"save" -> s1
	"revert" -> s1
	"kill" -> s1
#+end_src
Jos rinnankytkentöjen lopputuloset ovat toiminnallisesti samat, tehty
muunnos on laillinen.

#+begin_src fundamental :tangle optimised_repo.sml
REPO -> i_wait
 * i_wait : "open" -> s1
   	    "kill" -> m0
            "revert" -> nC
	    "save" -> i_save
 * s1 : "autogit-append" -> s2_
 * s2_ : "autogit-unsaved-changes" -> ( n_wait n3 )
 * s2 : "autogit-do-pull" -> ( s3 i_repair )
 * s3 : "autogit-do-push" -> ( s4 s2 )
 * s4 : "autogit-revert-all" -> n_wait
 * i_save : "autogit-append" -> s6
 * s6 : "autogit-do-add" -> ( nC nC )
 * s7 : "autogit-do-commit" -> ( s8 s8 )
 * s8 : "autogit-do-pull" -> ( s9 i_repair )
 * s9 : "autogit-do-push" -> ( sA s8 )
 * sA : "autogit-revert-all" -> n_wait
 * n_wait : "open"   -> n1
            "save"   -> nA
   	    "kill"   -> m0
	    "revert" -> nC

 * n1 : "autogit-append" -> n2
 * n2 : "autogit-unsaved-changes" -> ( n_wait n3 )
 * n3 : "autogit-do-pull" -> ( n4 i_repair )
 * n4 : "autogit-do-push" -> ( s4 n3 )
 * nA : "autogit-append" -> nB
 * nB : "autogit-do-add" -> ( nC nC )
 * nC : "autogit-unsaved-changes" -> ( n_wait nD )
 * nD : "autogit-do-commit" -> ( n3 n3 )

 * m0 : "autogit-remove" -> nC

 * i_repair : "autogit-revert-all" -> r_wait
 * r_wait : "open"   -> r1
	    "save"   -> rA
	    "kill"   -> rX
	    "revert" -> rC

 * r1 : "autogit-append" -> r_wait
 * rA : "autogit-append" -> rB
 * rB : "autogit-do-add" -> ( rC rC )
 * rC : "autogit-unsaved-changes" -> (r_wait rD)
 * rD : "autogit-do-commit" -> ( n3 r_wait )
 * rX : "autogit-remove" -> rC
#+end_src

Tarkistukset todistivat, että oletetulla tavalla käytettynä optimoitu versio
on ekvivalentti alkuperäisen kanssa. Minimoitu lopputulos on tällainen.
#+begin_src fundamental
START -> st_6
 * st_6 : "revert" -> st_7
        "kill" -> st_15
        "save" -> st_10
        "open" -> st_23
 * st_23 : "autogit-append" -> st_5
 * st_5 : "autogit-unsaved-changes" -> ( st_6 st_3 )
 * st_3 : "autogit-do-pull" -> ( st_1 st_21 )
 * st_21 : "autogit-revert-all" -> st_19
 * st_19 : "revert" -> st_16
        "kill" -> st_14
        "save" -> st_12
        "open" -> st_20
 * st_20 : "autogit-append" -> st_19
 * st_12 : "autogit-append" -> st_11
 * st_11 : "autogit-do-add" -> ( st_16 st_16 )
 * st_16 : "autogit-unsaved-changes" -> ( st_19 st_25 )
 * st_25 : "autogit-do-commit" -> ( st_3 st_19 )
 * st_14 : "autogit-remove" -> st_16
 * st_1 : "autogit-do-push" -> ( st_17 st_3 )
 * st_17 : "autogit-revert-all" -> st_6
 * st_10 : "autogit-append" -> st_9
 * st_9 : "autogit-do-add" -> ( st_7 st_7 )
 * st_7 : "autogit-unsaved-changes" -> ( st_6 st_26 )
 * st_26 : "autogit-do-commit" -> ( st_3 st_3 )
 * st_15 : "autogit-remove" -> st_7
#+end_src
./next_generation.svg


Seuraavassa on vanha versio, jonka kääntäminen ajettavaksi LSTS:ksi ei olisi
ollut mahdollista. Tai olisi saattanut ollakin, mutta halusin kokeilla,
miten toimintaa ohjaavan tilakoneen tekeminen inkrementaalisesti ja
suorituspolku kerrallaan onnistuisi. Samalla tuli käytettyä aitoja
tapahtumien nimieä.

#+begin_src fundamental
REPO -> not_exists
 * not_exists : "open" -> n_add_buffer
 * n_add_buffer: "append" -> need_sync
 * need_sync : "pull" -> ( s2  to_repair )
 * s2 : "push" -> ( s3  need_sync )
 * s3 : "revert_all" -> unstable_state
 * unstable_state : "save" -> q1
                    "revert" -> test_state
                    "kill_buffer" -> n_kill_buff
 		    "open" -> do_append
 * q1 : "add" -> test_state
 * test_state : "unsaved_changes" -> (unstable_state  do_commit)
 * do_append : "append" -> test_for_sync
 * n_kill_buff : "remove" -> test_state
 * test_for_sync : "unsaved_changes" -> (unstable_state  need_sync)
 * do_commit : "commit" -> (need_sync  need_sync)
 * to_repair : "revert_all" -> repair
 * repair : "save" -> r1
            "revert" -> repair_test
 	    "kill_buffer" -> r_kill_buff
 	    "open" -> r_add_buffer
 * r_add_buffer : "append" -> repair
 * r_kill_buff : "remove" -> repair_test
 * r1 : "add" -> repair_test
 * repair_test : "unsaved_changes" -> (repair  repair_commit)
 * repair_commit : "commit" -> (need_sync  repair)
#+end_src


Vaikka tuo tilakone näyttää hyvin ilmeiseltä, sen kasaaminen ei mennyt
kivuttomasti. Loppujen lopuksi tarvittiin kovin monta yritystä aikaisemmin
tehdyn toimivan prototyypin lisäksi, ennenkuin keskeinen olio ja näkökulma
löytyi. On liian helppo ajatua harhateille.

[2013-09-24 ti] Kaiken lisäksi tilakoneeseen oli jäänyt virheitä, jotka
onneksi huomasi, kun muotoili tilakoneen piirrosta. Sen jälkeen kun git on
voinut muuttaa tiedostoja, ennenkuin aloitetaan käyttäjän herätteen
odottaminen, pitää kaikki avoinna olevat bufferit päivittää vastaamaan levyn
tilannetta. Ainoa tiedostoja mahdollisesti muuttava git komento on pull.
Lisäksi tiedoston avaamisen jälkeen bufferi pitää lisätä repon buffereiden
joukkoon.

[2013-09-24 ti] Edelleen jäi huomaamatta, että myös bufferin tappamisen
täytyy heijastua avoimien puskureiden listaan, mistä seuraa, että
tilakoneeseen täytyy tehdä vastaavat siirtymät. Tämän huomasin vasta
koodauksen yhteydessä. Eli onpas ohjelmointi hankalaa.

[2013-09-24 ti] Korjatun tilakoneen tarkastuksessa havaitsin vielä, että
pull ja push muodostaa epäilyttävän silmukan. Jos pull ja push tehdään eri
repoon, mikä ei ole tavallista, järjestelmä voi jäädä ikuiseen silmukkaan,
jos pull onnistuu, mutta push ei. Toisaalta yleisin syy push-komennon
epäonnistumiseen on, että joku muu ehti laittamaan yhteiseen repoon tavaraa
edeltävän pull-komennon jälkeen, jolloin uusi pull korjaa tilanteen.

Tässäkin ihminen käsittelee editorin välityksellä tiedostoja, mutta se ei
ole olennaista. Olennaista on, miten tiedostoille tehtävät asiat heijastuvat
repositoriin ja mitkä tehtävistä asioista voivat toimia trikkereinä.

Toinen viivyttävä seikka on elisp-kielen outous itselle. Lisp (scheme) on
sinänsä tuttu kieli, mutta elispissä muuttujien näkyvuus ja mekanismit
olio-ohjelmointiin ovat ihan erilaiset. Myös shell komentojen tulosten
uittaminen muuttujien arvoiksi on konstikasta, mutta onneksi mahdollista.

** Repository object

#+begin_src emacs-lisp :tangle ../autogit.el
(defvar autogit-current-state nil)
(defvar autogit-open-buffers nil)
(defvar autogit-active nil)

(defun autogit-current-repository ()
  <<impl_get_current_repository>>
  )

(defun autogit-get-create-repo-obj ()
  (let* ((buff-name (autogit-current-repository))
	 (repo-buff (if buff-name (get-buffer buff-name) nil)))
    (if (not buff-name) nil
      (if repo-buff repo-buff
	(get-buffer-create buff-name)
	(with-current-buffer buff-name
	  (make-local-variable 'autogit-current-state)
	  (setq autogit-current-state autogit-init-state)
	  (make-local-variable 'autogit-open-buffers)
	  (setq autogit-open-buffers ())
          (autogit-travel-path 'init " command output")
	  (goto-char (point-min))
	  )
	(get-buffer buff-name)))))
#+end_src

#+name: impl_get_current_repository
#+begin_src emacs-lisp
(let* ((tmp-name " command output")
       (tmp-buff (progn (if (get-buffer tmp-name) (kill-buffer tmp-name))
			(get-buffer-create tmp-name)))
       (retcode (call-process "git" nil tmp-buff nil "rev-parse" "--git-dir"))
       (retval (if (eq 0 retcode)
		   (with-current-buffer tmp-buff
		     (buffer-substring-no-properties (point-min) (- (point-max) 1)))
		 nil)))
  (if retval (file-truename retval) nil))
#+end_src

** Repository behaviour as a state machine

#+begin_src emacs-lisp :tangle ../autogit.el
(defvar autogit-repo-transition-table ()
  "Autogit repository transitions table")
(defvar autogit-init-state nil)
(setq autogit-repo-transition-table
  <<converted_transition_table>>
  )
(defun autogit-skip (buff)
  (insert "-------------------------\n")
  't)

(defun autogit-travel-path (msg real-buffer)
  (if (cdr-safe autogit-current-state)
      (setq autogit-current-state
	    (cdr-safe (assoc msg autogit-current-state))))
  (if (not autogit-current-state)
      (insert "Internal error: State machine broken: no source state.\n"))
  (while (and autogit-current-state (not (cdr-safe autogit-current-state)))
    (let* ((tr (assoc autogit-current-state autogit-repo-transition-table))
	   (func (if tr (nth 1 tr) (insert "Internal error: State machine broken: state undefined\n") nil))
	   (next-sts (if tr (nth 2 tr) (insert "Internal error: State machine broken: state undefined\n") nil)))
      (setq autogit-current-state
	    (if (funcall func (get-buffer real-buffer))
		(car next-sts)
	      (car (cdr next-sts))))))
  autogit-current-state
  )
#+end_src

Following is state machine data structure. It is provided for your
convenience, because TMaVT is not available yet and it can not be produced
on the fly during tangling.

#+call: lsts_to_elisp_converter(LSTS="next_generation.lsts")

#+name: converted_transition_table
#+begin_src emacs-lisp
(progn (setq autogit-init-state "st_6")
'(
  ("st_6" autogit-skip (("waiting_input"
      ( revert . "st_7")
      ( kill . "st_15")
      ( save . "st_10")
      ( open . "st_23")
     )  nil ) )
  ("st_23" autogit-append (  "st_5" "st_5" ) )
  ("st_5" autogit-unsaved-changes ( "st_6" "st_3" ) )
  ("st_3" autogit-do-pull ( "st_1" "st_21" ) )
  ("st_21" autogit-revert-all (  "st_19" "st_19" ) )
  ("st_19" autogit-skip (("waiting_input"
      ( revert . "st_16")
      ( kill . "st_14")
      ( save . "st_12")
      ( open . "st_20")
     )  nil ) )
  ("st_20" autogit-append (  "st_19" "st_19" ) )
  ("st_12" autogit-append (  "st_11" "st_11" ) )
  ("st_11" autogit-do-add ( "st_16" "st_16" ) )
  ("st_16" autogit-unsaved-changes ( "st_19" "st_25" ) )
  ("st_25" autogit-do-commit ( "st_3" "st_19" ) )
  ("st_14" autogit-remove (  "st_16" "st_16" ) )
  ("st_1" autogit-do-push ( "st_17" "st_3" ) )
  ("st_17" autogit-revert-all (  "st_6" "st_6" ) )
  ("st_10" autogit-append (  "st_9" "st_9" ) )
  ("st_9" autogit-do-add ( "st_7" "st_7" ) )
  ("st_7" autogit-unsaved-changes ( "st_6" "st_26" ) )
  ("st_26" autogit-do-commit ( "st_3" "st_3" ) )
  ("st_15" autogit-remove (  "st_7" "st_7" ) )
))
#+end_src

