autogit.el
(defvar autogit-current-state nil)
(defvar autogit-open-buffers nil)
(defvar autogit-active nil)

(defun autogit-current-repository ()
  (let* ((tmp-name " command output")
         (tmp-buff (progn (if (get-buffer tmp-name) (kill-buffer tmp-name))
  			(get-buffer-create tmp-name)))
         (retcode (call-process "git" nil tmp-buff nil "rev-parse" "--git-dir"))
         (retval (if (eq 0 retcode)
  		   (with-current-buffer tmp-buff
  		     (buffer-substring-no-properties (point-min) (- (point-max) 1)))
  		 nil)))
    (if retval (file-truename retval) nil))
  )

(defun autogit-get-create-repo-obj ()
  (let* ((buff-name (autogit-current-repository))
	 (repo-buff (if buff-name (get-buffer buff-name) nil)))
    (if (not buff-name) nil
      (if repo-buff repo-buff
	(get-buffer-create buff-name)
	(with-current-buffer buff-name
	  (make-local-variable 'autogit-current-state)
	  (setq autogit-current-state autogit-init-state)
	  (make-local-variable 'autogit-open-buffers)
	  (setq autogit-open-buffers ())
          (autogit-travel-path 'init " command output")
	  (goto-char (point-min))
	  )
	(get-buffer buff-name)))))
(defvar autogit-repo-transition-table ()
  "Autogit repository transitions table")
(defvar autogit-init-state nil)
(setq autogit-repo-transition-table
  (progn (setq autogit-init-state "st_6")
  '(
    ("st_6" autogit-skip (("waiting_input"
        ( revert . "st_7")
        ( kill . "st_15")
        ( save . "st_10")
        ( open . "st_23")
       )  nil ) )
    ("st_23" autogit-append (  "st_5" "st_5" ) )
    ("st_5" autogit-unsaved-changes ( "st_6" "st_3" ) )
    ("st_3" autogit-do-pull ( "st_1" "st_21" ) )
    ("st_21" autogit-revert-all (  "st_19" "st_19" ) )
    ("st_19" autogit-skip (("waiting_input"
        ( revert . "st_16")
        ( kill . "st_14")
        ( save . "st_12")
        ( open . "st_20")
       )  nil ) )
    ("st_20" autogit-append (  "st_19" "st_19" ) )
    ("st_12" autogit-append (  "st_11" "st_11" ) )
    ("st_11" autogit-do-add ( "st_16" "st_16" ) )
    ("st_16" autogit-unsaved-changes ( "st_19" "st_25" ) )
    ("st_25" autogit-do-commit ( "st_3" "st_19" ) )
    ("st_14" autogit-remove (  "st_16" "st_16" ) )
    ("st_1" autogit-do-push ( "st_17" "st_3" ) )
    ("st_17" autogit-revert-all (  "st_6" "st_6" ) )
    ("st_10" autogit-append (  "st_9" "st_9" ) )
    ("st_9" autogit-do-add ( "st_7" "st_7" ) )
    ("st_7" autogit-unsaved-changes ( "st_6" "st_26" ) )
    ("st_26" autogit-do-commit ( "st_3" "st_3" ) )
    ("st_15" autogit-remove (  "st_7" "st_7" ) )
  ))
  )
(defun autogit-skip (buff)
  (insert "-------------------------\n")
  't)

(defun autogit-travel-path (msg real-buffer)
  (if (cdr-safe autogit-current-state)
      (setq autogit-current-state
	    (cdr-safe (assoc msg autogit-current-state))))
  (if (not autogit-current-state)
      (insert "Internal error: State machine broken: no source state.\n"))
  (while (and autogit-current-state (not (cdr-safe autogit-current-state)))
    (let* ((tr (assoc autogit-current-state autogit-repo-transition-table))
	   (func (if tr (nth 1 tr) (insert "Internal error: State machine broken: state undefined\n") nil))
	   (next-sts (if tr (nth 2 tr) (insert "Internal error: State machine broken: state undefined\n") nil)))
      (setq autogit-current-state
	    (if (funcall func (get-buffer real-buffer))
		(car next-sts)
	      (car (cdr next-sts))))))
  autogit-current-state
  )
