src/devel_workbook.org
** Implementations for the actions

#+begin_src emacs-lisp :tangle ../autogit.el
(defun autogit-unsaved-changes (buff)
  (insert "Is there unsaved buffers in " (buffer-name) "?\n")
  (let ((buffs autogit-open-buffers)
	(stop nil))
    (while (progn
	     (if buffs
		 (let* ((cub (car buffs))
			(modified (buffer-modified-p cub))
			(visits (buffer-file-name cub)))
		   (setq stop (or stop (and modified visits)))
		   (if (and stop visits)
		       (insert (concat visits " is under modification.\n"))
		     (setq buffs (cdr buffs)))))
	     (and (not stop) buffs)))
    stop))

(defun autogit-append (buff)
  (insert (concat "Tracking file: " (buffer-file-name buff) "\n"))
  (if (not (buffer-file-name buff)) 't
    (or (member buff autogit-open-buffers)
	(setq autogit-open-buffers (cons buff autogit-open-buffers)))
    't))

(defun autogit-remove (buff)
  (insert (concat "Releasing file: " (buffer-file-name buff) "\n"))
  (setq autogit-open-buffers (delete buff autogit-open-buffers))
  't)

(defun autogit-revert-all (buff)
  (insert (concat "Reverting files of the repository " (buffer-name) "\n"))
  (let ((buffs autogit-open-buffers))
    (while buffs
      (let* ((buffa (car buffs))
	     (rest-buffs (cdr buffs))
	     (visits (buffer-file-name buffa))
	     (modified (buffer-modified-p buffa))
	     (may-revert (and visits (not modified))))
	(if may-revert
	    (with-current-buffer buffa
	      (condition-case EDATA
		  (revert-buffer 't 't 't)
		(error (message "Revert problem: %s - %s"
				(car EDATA) (cdr EDATA )))
		)))
	(setq buffs rest-buffs))))
  't)

(defun autogit-do-pull (buff)
  (insert (concat "git pull in " (buffer-name) "\n"))
  (equal 0 (call-process "git" nil nil nil "pull" "--no-edit")))

(defun autogit-do-push (buff)
  (insert (concat "git push in " (buffer-name) "\n"))
  (equal 0 (call-process "git" nil nil nil "push")))

(defun autogit-do-add (buff)
  (insert (concat "git add " (buffer-file-name buff) "\n"))
  (equal 0 (call-process "git" nil nil nil "add" (buffer-file-name buff))))

(defun autogit-do-commit (buff)
  (insert (concat "git commit in " (buffer-name) "\n"))
  (equal 0 (call-process
	    "git" nil nil nil "commit" "-m" "... autogit-mode session")))
#+end_src

** Hooks

#+begin_src emacs-lisp :tangle ../autogit.el
(defun autogit-hook-function (operation)
  (if autogit-active 't
    (message "Autogit hook: %s-%s"
	     operation
	     (if (buffer-file-name)
		 (buffer-file-name)
	       (if (buffer-name) (buffer-name)
		 "Killed buffer")))
    (setq autogit-active 't)
    (let* ((real-buffer (current-buffer))
	   (repo-obj (autogit-get-create-repo-obj))
	   )
      (if (not repo-obj) 't
	(with-current-buffer repo-obj
	  (let* ((msg (cond
		       ((equal 'read operation)
			(if (member real-buffer autogit-open-buffers)
			    'revert
			  'open))
		       ((equal 'save operation)
			operation)
		       ((member real-buffer autogit-open-buffers)
			operation)
		       (t nil))))
	    (if msg (autogit-travel-path msg real-buffer) 't)
	    (goto-char (point-min))))))
    (setq autogit-active nil)))
(defun autogit-read-hook ()
  (autogit-hook-function 'read))
(defun autogit-save-hook ()
  (autogit-hook-function 'save))
(defun autogit-kill-hook ()
  (autogit-hook-function 'kill))
#+end_src

Emacs seems to create and kill temporary buffers while reading and writing
files and kill-buffer-hook is called for those. That's why hook is aborted
if the current buffer is not tracked by autogit.

The cond statement in autogit-hook-function ensures that initially, when
repository object does not track any files yet, killing or reverting can not
happen and state machine optimisation assumptions are met.

#+begin_src emacs-lisp :tangle ../autogit.el
; after-save-hook
(add-hook 'after-save-hook 'autogit-save-hook)
; find-file-hook
(add-hook 'find-file-hook 'autogit-read-hook)
; kill-buffer-hook is special. It have to set in open callback because it
;  may be buffer local.
(add-hook 'kill-buffer-hook 'autogit-kill-hook)
#+end_src


* Program logic from LSTS file

This script converts a state machine from LSTS form to elisp data structure.
It is customised for autogit and requires state machine interface from
TMaVT, which is easy to use front-end for Tampere Verification Tool
(https://github.com/hessuvi/TampereVerificationTool). TMaVT is not published
yet.

There are two things which are specific to autogit. Variable name
autogit-init-state and actions autogit-skip. The latter is supposed to be
always succeeding no-op action and it is used to keep produced emacs-lisp
code more readable.

#+name: lsts_to_elisp_converter
#+HEADER: :var LSTS="next_generation.lsts"
#+begin_src python :results output
import TMaVT.model_io as mio

found_states = set()
waiting = list()

with file(LSTS, "r") as lsts :
    data = mio.lsts_to_model(lsts)
    waiting.append(data.getInitialState())
    print r'(progn (setq autogit-init-state "st_%s")' % str( waiting[-1])
    print "'("
    while len(waiting) > 0 :
        c_st = waiting.pop()
        c_st_num = int(str(c_st))
        if c_st_num in found_states :
            continue
        found_states.add(c_st_num)
        tr_set = c_st.getOutTransitions()
        ack_set = set( [ t.getAction() for t in tr_set ] )
        if len( tr_set ) > 1 :
            print r'  ("st_%s" autogit-skip (("waiting_input"' % str(c_st)
            for tr in tr_set:
                print r'      ( %s . "st_%s")' % ( tr.getAction(),
                                                 tr.getDestState())
                waiting.append(tr.getDestState())
            print '     )  nil ) )'
        else :
            tr = c_st.getOutTransitions()[0]
            ack = tr.getAction()
            d_st = tr.getDestState()
            next_trs = d_st.getOutTransitions()
            next_ack = [ ( "%s" % t.getAction(), t.getDestState()) for t in next_trs]
            print r'  ("st_%s" %s (' % (c_st, ack),
            if len(next_ack) > 1 and next_ack[0][0][0:6]=="__ret_" :
                next_ack.sort()
                for (rv, ds) in next_ack :
                    print r'"st_%s"' % ds ,
                    waiting.append(ds)
            else :
                print r' "st_%s" "st_%s"' % (d_st, d_st) ,
                waiting.append(d_st)
            print ") )"
    print '))'
#+end_src

* Makefile

This is example, how state machine language notation is converted to visual
representation. Visual representation can be viewed with tvt.modeller.
Programs tvt.CFFD_normalize and tvt.illus are part of Tampere Verification
Tool (https://github.com/hessuvi/TampereVerificationTool) and
tvt.sm_lang_comp and tvt.modeller will be included in TMaVT when it is
published.

#+begin_src makefile :tangle Makefile
%.illus: %.lsts
	cat $< | tvt.illus - > $@

%.lsts: %.sml
	cat $< | tvt.sm_lang_comp | tvt.CFFD_normalize - - > $@
#+end_src
