autogit.el
(defun autogit-unsaved-changes (buff)
  (insert "Is there unsaved buffers in " (buffer-name) "?\n")
  (let ((buffs autogit-open-buffers)
	(stop nil))
    (while (progn
	     (if buffs
		 (let* ((cub (car buffs))
			(modified (buffer-modified-p cub))
			(visits (buffer-file-name cub)))
		   (setq stop (or stop (and modified visits)))
		   (if (and stop visits)
		       (insert (concat visits " is under modification.\n"))
		     (setq buffs (cdr buffs)))))
	     (and (not stop) buffs)))
    stop))

(defun autogit-append (buff)
  (insert (concat "Tracking file: " (buffer-file-name buff) "\n"))
  (if (not (buffer-file-name buff)) 't
    (or (member buff autogit-open-buffers)
	(setq autogit-open-buffers (cons buff autogit-open-buffers)))
    't))

(defun autogit-remove (buff)
  (insert (concat "Releasing file: " (buffer-file-name buff) "\n"))
  (setq autogit-open-buffers (delete buff autogit-open-buffers))
  't)

(defun autogit-revert-all (buff)
  (insert (concat "Reverting files of the repository " (buffer-name) "\n"))
  (let ((buffs autogit-open-buffers))
    (while buffs
      (let* ((buffa (car buffs))
	     (rest-buffs (cdr buffs))
	     (visits (buffer-file-name buffa))
	     (modified (buffer-modified-p buffa))
	     (may-revert (and visits (not modified))))
	(if may-revert
	    (with-current-buffer buffa
	      (condition-case EDATA
		  (revert-buffer 't 't 't)
		(error (message "Revert problem: %s - %s"
				(car EDATA) (cdr EDATA )))
		)))
	(setq buffs rest-buffs))))
  't)

(defun autogit-do-pull (buff)
  (insert (concat "git pull in " (buffer-name) "\n"))
  (equal 0 (call-process "git" nil nil nil "pull" "--no-edit")))

(defun autogit-do-push (buff)
  (insert (concat "git push in " (buffer-name) "\n"))
  (equal 0 (call-process "git" nil nil nil "push")))

(defun autogit-do-add (buff)
  (insert (concat "git add " (buffer-file-name buff) "\n"))
  (equal 0 (call-process "git" nil nil nil "add" (buffer-file-name buff))))

(defun autogit-do-commit (buff)
  (insert (concat "git commit in " (buffer-name) "\n"))
  (equal 0 (call-process
	    "git" nil nil nil "commit" "-m" "... autogit-mode session")))
(defun autogit-hook-function (operation)
  (if autogit-active 't
    (message "Autogit hook: %s-%s"
	     operation
	     (if (buffer-file-name)
		 (buffer-file-name)
	       (if (buffer-name) (buffer-name)
		 "Killed buffer")))
    (setq autogit-active 't)
    (let* ((real-buffer (current-buffer))
	   (repo-obj (autogit-get-create-repo-obj))
	   )
      (if (not repo-obj) 't
	(with-current-buffer repo-obj
	  (let* ((msg (cond
		       ((equal 'read operation)
			(if (member real-buffer autogit-open-buffers)
			    'revert
			  'open))
		       ((equal 'save operation)
			operation)
		       ((member real-buffer autogit-open-buffers)
			operation)
		       (t nil))))
	    (if msg (autogit-travel-path msg real-buffer) 't)
	    (goto-char (point-min))))))
    (setq autogit-active nil)))
(defun autogit-read-hook ()
  (autogit-hook-function 'read))
(defun autogit-save-hook ()
  (autogit-hook-function 'save))
(defun autogit-kill-hook ()
  (autogit-hook-function 'kill))
; after-save-hook
(add-hook 'after-save-hook 'autogit-save-hook)
; find-file-hook
(add-hook 'find-file-hook 'autogit-read-hook)
; kill-buffer-hook is special. It have to set in open callback because it
;  may be buffer local.
(add-hook 'kill-buffer-hook 'autogit-kill-hook)
